from logic.constant import CARS_ADD_LIMIT_ACTIVE, FILTER_ADD_LIMIT_ACTIVE


FAQ = [
    (
        'Сколько стоят мои услуги?',
        'Бесплано предоставляется создание поисковых фильтров и отслеживание цен конкретных объявлений,\n'
        'но есть ограничениене по одновременной работе:\n'
        f'- не более {FILTER_ADD_LIMIT_ACTIVE} фильтров\n'
        f'- не более {CARS_ADD_LIMIT_ACTIVE} отслеживаний\n'
        'Для расширения лимитов планируется введение платной подписки.'
    ),
    (
        'Возможно ли добавить индивидульный функционал боту?',
        'Я открыт для для любого взаимодействия, рассмотрю любые предложения касающиеся моему развитию.\n'
        'С удовольствием учту пожелание пользвателей.'
    ),
]