TXT = {
    # {start info}
    'info_start_menu_help':
        '📌 <b>Вот несколько команд для начала</b> 😉\n'
        '\n'
        '✅ Открыть главное меню - <b>/start</b>\n'
        '\n'
        '✅ Cоздать фильтр - <b>/car</b>\n'
        '\n'
        '✅ Узнать больше команд - <b>/help</b>',

    'info_filter_menu_help':
        '📌 Нажав на фильтр можно заказать сравнительный отчет о всех активных объявлениях.\n'
        '\n'
        'Отчет представляет собой PDF-файл, нажав на марку в файле можно перейти к обявлению на сайте.\n'
        '\n'
        'Отчет содержит, VIN, сколько дней опубликовано объявление, город... и многое другое.\n',

    'info_stalk_menu_help':
        '📌 Я уведомлю вас о изменениях цен на машины в этом списке.',

    'info_save_search':
        '📌 Теперь мы будем присылать вам свежие объявления\n'
        '\n'
        'Все текущие объявления можно сформировть как отчет в управлении фильтрами.\n'
        '\n'
        'При возникновении трудноситей жми [Помощь].\n',

    'info_bot':
        '📌 <b>Основные функции:</b>\n'
        '\n'
        '✅ Автоматическая рассылка пользователям свежих обявлений\n' 
        '\n' 
        '✅ Отслеживание изменения цен\n'
        '\n'
        '✅ Формирование отчета с текущими обявлениями\n'
        '\n'
        '👉: <a href="https://t.me/Xibolba">@Xibolba</a>\n'
        '✉: insider_2012@mail.ru\n',

    'info_filter':
        "📌 {decode_filter_short}\n"
        "\n"
        "📊 Доступные объявления:\n"
        "\n"
        "<a href='{av_l}'>av.by</a> - {all_av}.\n"
        "<a href='{abw_l}'>abw.by</a> - {all_abw}.\n"
        "<a href='{onliner_l}'>onliner.by</a> - {all_onliner}.\n"
        "\n"
        "⚠ Действует ограничение до ~125 объявлений с 1 ресурса.\n",

    'info_start_menu':
        '📌 Я помогу вам найти подходящий автомобиль.\n'
        'Просто создайте и сохраните необходимый поиск-фильтр, и занимайтесь привычными делами.\n',

    'info_filter_menu': '📌 Как только появится подходящая машина - я дам знать 😉',
    'info_stalk_menu': '📌 Я внимательно слежу за ценами в этом списке 😎',
    'info_add_stalk_menu': '📌 Отправьте сюда ссылку на обявление. Можно отправить несколько разделив пробелом',
    # {end info}

    # {start buttons}
    'btn_search': '🔎 Автопоиск',
    'btn_stalk': '📉 Оследить цену',
    'btn_info': '💪 Мои возможности',
    'btn_show_help': '❓ Помощь',
    'btn_hide_help': '❗ Скрыть Помощь',
    'btn_cancel': '❌ Отмена',
    'btn_save': '✅ Сохранить',
    'btn_back': '< Назад',
    'btn_delete': '🗑 Удалить',
    'btn_add_filter': '➕ Добавить фильтр',
    'btn_off': '⏹ Стоп',
    'btn_on': '▶ Пуск',
    'btn_start_menu': '<< Главное меню',
    'btn_rep_filter': '📝 Создать отчет',
    'btn_stalk_price': '📉 Отслеживать цену',
    'btn_add_stalk_url': '➕ Добавить машину',
    # {end buttons}

    # {start bot_messages}
    'msg_error': '⚠ Произошла ошибка',
    'msg_collect_data': '⏳ Собираем данные',
    'msg_cooking_rep': '⌛ Готовим отчет',
    # {end bot_messages}

    # {start create_filter}
    'f_brand': 'Выберите бренд автомобиля:',
    'fi_brand': 'имя бренда:',
    'f_model': 'Теперь, выберите модель:',
    'fi_model': 'имя модели',
    'f_motor': 'Теперь, выберите тип топлива:',
    'fi_motor': 'тип топлива:',
    'f_transmission': 'Теперь, выберите тип трансмиссии:',
    'fi_transmission': 'тип трансмиссии',
    'f_year_from': 'Теперь, выберите с какого года:',
    'fi_year_from': 'год от',
    'f_year_to': 'Теперь, выберите по какой год:',
    'fi_year_to': 'год по',
    'f_price_from': 'Теперь, выберите начальную цену:',
    'fi_price_from': 'стоимость от',
    'f_price_to': 'Теперь, выберите максимальную цену:',
    'fi_price_to': 'стоимость до',
    'f_dimension_from': 'Теперь, выберите минимальный объем двигателя:',
    'fi_dimension_from': 'объем двигателя от',
    'f_dimension_to': 'Теперь, выберите максимальный объем двигателя:',
    'fi_dimension_to': 'объем двигателя до',
    # {end create_filter}

    'page_left': '<',
    'page_right': '>',
}
