


TXT = {
    'start_menu_help':
        'БОТ поможет вам найти подходящий автомобиль.\n'
        'Просто создайте и сохраните необходимый поиск-фильтр, и БОТ начнет вам присылать свежие обявления.\n'
        '- Открыть главное меню - /start.\n'
        '- Cоздать фильтр  - /car.\n'
        '- Если необходимо оставить параметр пустым выбирайте - [?].\n'
        '- Если хотите прпустить шаги с выбором параметров нажмите [menu]->[/show].\n'
        '- Сохраненные фильтры можно отключить или удалить в управлнии фильтрами.\n'
        '- Узнать больше команд /help.'
    ,
    'params_menu_help':
        'Нажав на фильтр можно заказать сравнительный отчет о всех активных объявлениях.\n'
        'Отчет представляет собой PDF-файл, нажав на марку в файле можно перейти к обявлению на сайте.\n'
        'Отчет содержит, VIN, сколько дней опубликовано объявление, город... и многое другое.\n'
    ,
    'stalk_menu_help':
        'БОТ уведомит вас о изменениях цен на машины в этом списке.'
    ,
    'save_search':
        'Теперь мы будем присылать вам свежие объявления\n'
        'Все текущие объявления можно сформировть как отчет в управлении фильтрами.\n'
        'При возникновении трудноситей жми [Помощь].\n'
    ,
    'bot_info':
        "Основные функции:\n"
        "- Автоматическая рассылка пользователям свежих обявлений. "
        "- Отслеживание изменения цен.\n"
        "- Формирование отчета с текущими обявлениями.\n"
        "tel: <a href='https://t.me/Xibolba'>@Xibolba</a>\ne-mail: insider_2012@mail.ru\n"
    ,
}

